# Erstellen einer Mario Datenbank
Nutze die DDL (Data Definition Language) und DML (Data Manimulation Language) um eine Mario Datenbank zu erstellen. Von der DQL (Data Query Language) muss nur eine einfache Datenbankabfrage `SELECT * FROM <table>` verwendet werden.

## 1. Level: Erstellung Datenbank
Erstelle mit SQLite eine Mario Datenbank `mario.db`

In [1]:
# Initialisierung: Nicht ändern oder löschen
import sqlite3
import pandas as pd
db_filename = "mario.db"

try:
    if connection != None:
        connection.commit()
    if cursor != None:
        cursor.close()
except:
    pass
finally:
    connection = None # database connection
    cursor = None     #database cursor

# Füge hier deine Antwort ein:
connection = sqlite3.connect(db_filename)
cursor = connection.cursor()

## 2. Level: Erstellung Tabellen
Erstelle folgende Tabellen aber **nur dann wenn diese nicht schon exsistieren**:
- `characters`: Mit Attribut `surname` vom Datentyp `VARCHAR(30)` mit `NOT NULL` und `UNIQUE` Bedingung.
- `actions`: Mit Attribut `action_id` welches ein `PRIMARY KEY `vom Datentyp `INT` sein soll. 
- `music`: Mit Attribut `volumne` vom Datentyp `DOUBLE` und `NOT NULL` Bedingung.

In [ ]:

cursor.execute("""
CREATE TABLE IF NOT EXISTS characters 
(surname VARCHAR(30) NOT NULL UNIQUE)       
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS actions 
(action_id INT PRIMARY KEY )       
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS music 
(volumne DOUBLE NOT NULL)       
""")

## 3. Level: Characters Tabelle
### 3.1. Daten einfügen
Füge der `characters` Tabelle `Mario` und `Luigi` hinzu und gib die Tabelle mithilfe von Pandas (`pd.read_sql`) schön aus. Da Aufgrund der `UNIQE` Bedingung nicht zwei gleiche Werte eingetragen werden können. Kann es sein, dass zum Testen der Einfügecode auskommentiert werden muss! Optional können Sie auch alle Daten in der Tabelle vorab löschen.

#### Erwartete Ausgabe
| surname   |
|:----------|
| Mario     |
| Luigi     |

In [ ]:
'''cursor.execute("""
INSERT INTO characters (name) VALUES 
    ('Mario'), 
    ('Luigi');
""")'''


pd.read_sql("SELECT * FROM characters", connection)

   character_id   name
0             1  Mario
1             2  Luigi

### 3.2. Umbenennen
Benenne nun die Spalte `surname` in `name` um. 

> Damit die Umbennenung in der `TABLE_INFO` sichtbar ist, müssen die Änderungen mittels `commit` geschrieben werden.

#### Erwartete Ausgabe
| name   |
|:-------|
| Mario  |
| Luigi  |

In [2]:
'''cursor.execute("ALTER TABLE characters RENAME surname TO name")'''
connection.commit()
pd.read_sql("PRAGMA TABLE_INFO (characters)", connection)

   cid            name         type  notnull          dflt_value  pk
0    0            name  VARCHAR(30)        1                None   0
1    1        homeland  VARCHAR(60)        1  'Mushroom Kingdom'   0
2    2  favorite_color  VARCHAR(20)        1               'Red'   0

### 3.3. Hinzufügen Primary Key
Es wurde der Primary Key (PK) in der characters Tabelle vergessen. Ein PK kann man nicht einfach einer bestehenden Tabelle hinzufügen. Man muss zuerst eine Temporäre Tabelle mit PK erstellen und anschließend den Inhalt der alten in die neue kopieren. Abschließend kann die alte Tabelle gelöscht und die neue umbenannt werden.

Füge der `characters` Tabelle `character_id`: `PRIMARY KEY `vom Datentyp `INTEGER`hinzu.

> Damit die Umbennenung in der `TABLE_INFO` sichtbar ist, müssen die Änderungen mittels `commit` geschrieben werden.

#### Erwartete Ausgabe
|   character_id | name   |
|---------------:|:-------|
|              1 | Mario  |
|              2 | Luigi  |

In [ ]:
#cursor.execute("""CREATE TABLE IF NOT EXISTS tempcharacters(character_id INTEGER PRIMARY KEY, name VARCHAR(30) NOT NULL UNIQUE);""")
#cursor.execute("""INSERT INTO tempcharacters (name) SELECT name FROM characters;""")
#cursor.execute("DROP TABLE characters")
#cursor.execute("ALTER TABLE tempcharacters RENAME TO characters")

pd.read_sql("SELECT * FROM characters", connection)

    name          homeland favorite_color
0  Mario  Mushroom Kingdom            Red
1  Luigi  Mushroom Kingdom            Red
2  Peach  Mushroom Kingdom           Pink

### 3.3. Hinzufügen von mehr Daten.
Füge der `characters` Tabelle folgende Attribute hinzu:
- `homeland`: `VARCHAR(60)` und `NOT NULL` Bedingung
- `favorite_color`: `VARCHAR(20)` und `NOT NULL` Bedingung

> ACHTUNG: Weil die `characters` Tabelle schon Einträg (Daten) hat, kann **ohne** einen Default Wert keine neue Spalte hinzugefügt werden!

Füge den Charakter `Peach` hinzu und fülle die leeren Felder der bestehenden Charaktere auf mit:
- Mario, Mushroom Kingdom, Red
- Luigi, Mushroom Kingdom, Green
- Peach, Mushroom Kingdom, Pink

> Nutze dafür `INSERT` für `Peach` und `UPDATE` für `Mario` und `Luigi`

#### Erwartete Ausgabe
|   character_id | name   | homeland         | favorite_color   |
|---------------:|:-------|:-----------------|:-----------------|
|              1 | Mario  | Mushroom Kingdom | Red              |
|              2 | Luigi  | Mushroom Kingdom | Green            |
|              3 | Peach  | Mushroom Kingdom | Pink             |

In [62]:
'''cursor.execute("""
ALTER TABLE characters ADD homeland VARCHAR(60) NOT NULL DEFAULT 'Mushroom Kingdom' """)'''

'''cursor.execute("""
ALTER TABLE characters ADD favorite_color VARCHAR(20) NOT NULL DEFAULT 'Red' """)'''

'''cursor.execute("INSERT INTO characters (name, favorite_color) VALUES ('Peach', 'Pink')")'''

'''cursor.execute("UPDATE characters SET favorite_color='Green' WHERE name='Luigi'")'''

pd.read_sql("SELECT * FROM characters", connection)

   character_id   name          homeland favorite_color
0             1  Mario  Mushroom Kingdom            Red
1             2  Luigi  Mushroom Kingdom            Red
2             3  Peach  Mushroom Kingdom           Pink

## 4. Level: Music Tabelle

### 4.1. Hinzufügen Filename
Gib das `filename` Attribute vom Datentyp `VARCHAR(100)` und `NOT NULL` und `UNIQUE` Bedingung der `music` Tabelle hinzu. Gib die Tabelle aus!

#### Erwartete Ausgabe
| volumne   | filename   |
|-----------|------------|

In [87]:
'''cursor.execute("DROP TABLE music")
cursor.execute("""CREATE TABLE music 
(volumne DOUBLE NOT NULL, filename VARCHAR(100) NOT NULL UNIQUE); """  )'''
pd.read_sql("PRAGMA TABLE_INFO (music)", connection)
connection.commit()

### 4.2. Hinzufügen von Soundfiles

Füge folgende Soundfiles mit Volumne 1 hinzu:

- `its-a-me.wav` (Mario)
- `yippee.wav` (Mario)
- `ha-ha.wav` (Luigi)
- `oh-yeah.wav` (Luigi)
- `yay.wav` (Peach)
- `woo-hoo.wav` (Luigi)
- `mm-hmm.wav` (Peach)
- `yahoo.wav` (Mario)

#### Erwartete Ausgabe

|   volumne | filename     |
|----------:|:-------------|
|         1 | its-a-me.wav |
|         1 | yippee.wav   |
|         1 | ha-ha.wav    |
|         1 | oh-yeah.wav  |
|         1 | yay.wav      |
|         1 | woo-hoo.wav  |
|         1 | mm-hmm.wav   |
|         1 | yahoo.wav    |

In [6]:
'''cursor.execute("""
INSERT INTO music (volumne, filename) VALUES
(1, "its-a-me.wav"),
(1, "yippee.wav"),
(1, "ha-ha.wav"),
(1, "oh-yeah.wav"),
(1, "yay.wav"),
(1, "woo-hoo.wav"),
(1, "mm-hmm.wav"),
(1, "yahoo.wav");
""")'''

pd.read_sql("SELECT * FROM music", connection)
connection.commit()

### 4.3. Hinzufügen von PK und weitere Attribute
Erweitere die `music` Tabelle um folgende Attribute und benenne diese in Tabelle `sounds` um. Lösche die alte `music` Tabelle.

- `sound_id` von Datentyp `INTEGER` mit `PRIMARY KEY`Bedingung.
- `filename` vom Datentyp `VARCHAR(100)` mit `NOT NULL` und `UNIQUE` Bedingung.
- `character_id` vom Datentyp `INTEGER` mit `FOREIGN KEY` und `NOT NULL` Bedingung (`FK` von der `characters` Tabelle).

> ACHTUNG: `filename` bekommt eine **UNIQUE** Bedinung\
> ACHTUNG: `character_id` benötigt einen Default-Wert Aufgrund der `NOT NULL` Bedinung

Das `volumne` Attribut soll gelöscht bzw. nicht übernommen werden.

#### Erwartete Ausgabe
|   sound_id |   character_id | filename     |
|-----------:|---------------:|:-------------|
|          1 |              0 | its-a-me.wav |
|          2 |              0 | yippee.wav   |
|          3 |              0 | ha-ha.wav    |
|          4 |              0 | oh-yeah.wav  |
|          5 |              0 | yay.wav      |
|          6 |              0 | woo-hoo.wav  |
|          7 |              0 | mm-hmm.wav   |
|          8 |              0 | yahoo.wav    |

In [ ]:
#cursor.execute("CREATE TABLE sounds (sound_id INTEGER PRIMARY KEY, filename VARCHAR(100) NOT NULL UNIQUE, character_id INTEGER NOT NULL DEFAULT 0, FOREIGN KEY (character_id) REFERENCES characters(character_id))")
#cursor.execute("INSERT INTO sounds (filename) SELECT filename FROM music")
#cursor.execute("DROP TABLE music")

connection.commit()
pd.read_sql("SELECT * FROM sounds", connection)

   sound_id      filename  character_id
0         1     ha-ha.wav             0
1         2  its-a-me.wav             0
2         3    mm-hmm.wav             0
3         4   oh-yeah.wav             0
4         5   woo-hoo.wav             0
5         6     yahoo.wav             0
6         7       yay.wav             0
7         8    yippee.wav             0

### 4.4. Hinzufügen vom FK
Füge die korrekte `character_id` zu den Soundfiles hinzu. Nutze hierfür den `UPDATE` Befehl.

#### Erwartete Ausgabe
   sound_id |   character_id | filename     |
|-----------:|---------------:|:-------------|
|          1 |              1 | its-a-me.wav |
|          2 |              1 | yippee.wav   |
|          3 |              2 | ha-ha.wav    |
|          4 |              2 | oh-yeah.wav  |
|          5 |              3 | yay.wav      |
|          6 |              2 | woo-hoo.wav  |
|          7 |              3 | mm-hmm.wav   |
|          8 |              1 | yahoo.wav    |

In [ ]:
'''cursor.execute("UPDATE sounds SET character_id=1 WHERE sound_id=1")
cursor.execute("UPDATE sounds SET character_id=1 WHERE sound_id=2")
cursor.execute("UPDATE sounds SET character_id=2 WHERE sound_id=3")                 
cursor.execute("UPDATE sounds SET character_id=2 WHERE sound_id=4")
cursor.execute("UPDATE sounds SET character_id=3 WHERE sound_id=5")
cursor.execute("UPDATE sounds SET character_id=2 WHERE sound_id=6")
cursor.execute("UPDATE sounds SET character_id=3 WHERE sound_id=7")
cursor.execute("UPDATE sounds SET character_id=1 WHERE sound_id=8")'''

pd.read_sql("SELECT * FROM sounds", connection)

   sound_id      filename  character_id
0         1     ha-ha.wav             1
1         2  its-a-me.wav             1
2         3    mm-hmm.wav             2
3         4   oh-yeah.wav             2
4         5   woo-hoo.wav             3
5         6     yahoo.wav             2
6         7       yay.wav             3
7         8    yippee.wav             1

## 5. Level Action Tabelle

### 5.1. Attribute hinzufügen
Füge folgende Attribute der `actions` Tabelle hinzu:
- `action`: Datentype `VARCHAR(20)` mit `NOT NULL` Bedingung

> Nutze dafür den `ALTER` Befehl

#### Erwartete Ausgabe
| action_id   | action   |
|-------------|----------|

In [ ]:
#cursor.execute("ALTER TABLE actions ADD COLUMN action VARCHAR(20) NOT NULL")
pd.read_sql("SELECT * FROM actions", connection)

Empty DataFrame
Columns: [action_id, action]
Index: []

### 5.2. Daten hinzufügen
Füge folgende Aktionen der `actions` Tabelle hinzu:
- duck
- jump
- run

> Nutze dafür den `ALTER` Befehl

#### Erwartete Ausgabe
| action_id   | action   |
|:------------|:---------|
|             | duck     |
|             | jump     |
|             | run      |

In [ ]:
'''cursor.execute("INSERT INTO actions (action) VALUES ('duck')")
cursor.execute("INSERT INTO actions (action) VALUES ('jump')")
cursor.execute("INSERT INTO actions (action) VALUES ('run')")'''

pd.read_sql("SELECT * FROM actions", connection)

   action_id action
0          1   duck
1          2   jump
2          3    run

### 5.3. Tabelle fixen
Die `action_id` Spalte bleibt leer, obwohl diese Spalte ein `PK` sein soll. Das Problem ist der Datentyp `INT` welcher nicht als `PK` verwendet werden darf. Als `PK` darf nur der Datentyp `INTEGER` verwendet werden.

- Erstelle eine temporäre Tabelle mit richtigem `PK` und `action` Spalte. Füge dem `action` Attribute zusätzlich die `UNIQUE` Bedingung hinzu
- Kopiere die Daten aus der alten Tabelle in die neue.
- Lösche die alte `actions` Tabelle.
- Nenne die neue Tabelle zu `actions` um.


#### Erwartete Ausgabe
|   action_id | action   |
|------------:|:---------|
|           1 | duck     |
|           2 | jump     |
|           3 | run      |

In [45]:
'''cursor.execute("""
CREATE TABLE actiontemp 
(action_id INTEGER PRIMARY KEY, action VARCHAR(20) NOT NULL UNIQUE)       
""")'''

#cursor.execute("INSERT INTO actiontemp (action) SELECT action FROM actions")
#cursor.execute("DROP TABLE actions")
#cursor.execute("ALTER TABLE actiontemp RENAME TO actions")

pd.read_sql("SELECT * FROM actions", connection)

   action_id action
0          1   duck
1          2   jump
2          3    run

## 6. Level: Zusätzliche Infos für Charaktere
Erstelle eine `more_info` Tabelle mit folgenden Attributen:
- `more_info_id`: `PRIMARY KEY `vom Datentyp `INTEGER`.
- `character_id`: `FOREIGN KEY `vom Datentyp `INTEGER` aus der Tabelle `characters` mit `UNIQUE` und `NOT NULL` Bedingung.
- `birthday `: Datentyp `DATE` mit `NOT NULL` Bedingung.
- `height`: Datentyp `DOUBLE` und `NOT NULL` Bedingung.

#### Erwartete Ausgabe
| more_info_id   | character_id   | birthday   | height   |
|----------------|----------------|------------|----------|

In [56]:
'''cursor.execute("""
CREATE TABLE more_info (
    more_info_id   INTEGER PRIMARY KEY,
    character_id   INTEGER UNIQUE NOT NULL,
    birthday       DATE NOT NULL,
    height         DOUBLE NOT NULL,
    FOREIGN KEY (character_id) REFERENCES characters(character_id)
);
""")'''

pd.read_sql("SELECT * FROM more_info", connection)

Empty DataFrame
Columns: [more_info_id, character_id, birthday, height]
Index: []

### 6.1. Daten einfügen
Füge folgende Daten in die `more_info` Tabelle:
| Name   | Birthday   | Height (cm) |
|--------|------------|-------------|
| Mario  | 09-07-1981 | 155         |
| Luigi  | 13-09-1983 | 160         |
| Peach  | 18-10-1985 | 175         |

In [64]:
'''cursor.execute("""
INSERT INTO more_info (character_id, birthday, height) VALUES
((SELECT character_id FROM characters WHERE name = 'Mario'), '1981-07-09', 155),
((SELECT character_id FROM characters WHERE name = 'Luigi'), '1983-09-13', 160),
((SELECT character_id FROM characters WHERE name = 'Peach'), '1985-10-18', 175);
""")'''

pd.read_sql("SELECT * FROM more_info", connection)

   more_info_id  character_id    birthday  height
0             1             1  1981-07-09   155.0
1             2             2  1983-09-13   160.0
2             3             3  1985-10-18   175.0

## 7. Level: Verbindungstabelle: characters ↔ actions ↔ sounds
Erstelle folgende Verbindungstabelle:
- `characters_actions`: 
  - `character_id`: `FK` aus der `characters` Tabelle und `NOT NULL` Bedingung
  - `action_id`: `FK` aus der `actions` Tabelle und `NOT NULL` Bedingung
  - `sound_id`: `FK` aus der `sounds` Tabelle und `NOT NULL` Bedingung
  
> Es soll ein zusammengesetzter (composite) `PK` aus `character_id`, `action_id` und `sounds_id` erstellt werden.

In [ ]:
'''cursor.execute("""
CREATE TABLE characters_actions 
(character_id NOT NULL,
action_id NOT NULL,
sound_id NOT NULL,
PRIMARY KEY (character_id, action_id, sound_id),
FOREIGN KEY (character_id) REFERENCES characters(character_id),
FOREIGN KEY (action_id) REFERENCES actions(action_id),
FOREIGN KEY (sound_id) REFERENCES sounds(sound_id)
)
""")'''


pd.read_sql("SELECT * FROM characters_actions", connection)

Empty DataFrame
Columns: [character_id, action_id, sound_id]
Index: []

### 7.1 Hinzufügen von Aktionen
Füge folgende Aktionen der `characters_actions` Tabelle hinzu:
- Mario und Luigi können `springen`, `laufen` und `ducken`
- Peach ist sehr klein und kann daher nur `springen` und `laufen`

- Bei Mario sollen folgende Sounds abgespielt werden:
    - Laufen `its-a-me.wav`
    - Springen `yippee.wav`
    - Ducken `yahoo.wav`

- Bei Lugigi sollen folgende Sounds abgespielt werden:
    - Laufen `ha-ha.wav`
    - Springen `oh-yeah.wav`
    - Ducken `woo-hoo.wav`
  
- Bei Peach sollen folgende Sounds abgespielt werden:
    - Laufen `yay.wav `
    - Springen `mm-hmm.wav`

#### Erwartete Ausgabe:
|   character_id |   action_id |   sound_id |
|---------------:|------------:|-----------:|
|              1 |           1 |          8 |
|              1 |           2 |          2 |
|              1 |           3 |          1 |
|              2 |           1 |          6 |
|              2 |           2 |          4 |
|              2 |           3 |          3 |
|              3 |           2 |          7 |
|              3 |           3 |          5 |

In [83]:
'''cursor.execute("""
INSERT INTO characters_actions (character_id, action_id, sound_id) VALUES
    (1, 1, 8),
    (1, 2, 2),
    (1, 3, 1),

    (2, 1, 6),
    (2, 2, 4),
    (2, 3, 3),

    (3, 2, 7),
    (3, 3, 5);
""")'''

pd.read_sql("SELECT * FROM characters_actions", connection)

   character_id  action_id  sound_id
0             1          1         8
1             1          2         2
2             1          3         1
3             2          1         6
4             2          2         4
5             2          3         3
6             3          2         7
7             3          3         5

### 7.2. Fragen:
**Beantworte folgende Fragen:**
- **Frage 7.2.1 (1P):** Was für eine Beziehung (Relation) haben die Tabellen `characters` und `actions` zueinander?
- **Frage 7.2.2 (1P):** Was für eine Beziehung (Relation) haben die Tabellen `characters` und `sounds` zueinander?
- **Frage 7.2.3 (1P):** Was für eine Beziehung (Relation) haben die Tabellen `actions` und `sounds` zueinander?
- **Frage 7.2.4 (1P):** Was für eine Beziehung (Relation) haben die Tabellen `characters` und `more_info` zueinander?
- **Frage 7.2.5 (1P):** Was bedeuten folgende Einträge in dieser Verbindungstabelle?
    |   character_id |   action_id |   sound_id |
    |---------------:|------------:|-----------:|
    |              1 |           1 |          8 |
    |              3 |           3 |          5 |
- **Frage 7.2.6 (10P):** Zeichne ein **ERM** von unserer Mario Datenbank. Füge das Bild der Antwort hinzu.
    - **ACHTUNG:** Es wird nur der Pfad zu deinem Bild gespeichert. Das Bild muss mit dem Jupyter Notebook File abgegeben werden! Achte darauf, dass ein **relativer** Pfad verwendet wird.

#### Antworten
- **7.2.1:** 
    - **<Füge hier deine Antwort ein>**
- **7.2.2:**
    - **<Füge hier deine Antwort ein>**
- **7.2.3:**
    - **<Füge hier deine Antwort ein>**
- **7.2.4:**
    - **<Füge hier deine Antwort ein>**
- **7.2.5:**
    - **<Füge hier deine Antwort ein>**
- **7.2.6:**
    - **<Füge hier deine Antwort ein>**